import matplotlib.pyplot as plt
import numpy as np

# Вхідні дані
x = [5, 10, 25, 50, 100, 250, 500, 1000, 2500, 5000, 10000, 25000, 50000]
y = [0.0049, 0.0099, 0.0249, 0.0495, 0.019, 0.1, 0.25, 0.4, 0.4807, 0.495, 0.498, 0.4987, 0.49995]

#log_x = np.log10(x) #видалити дужки, якщо потрібно подати х у логарифмічній шкалі


plt.figure(figsize=(10, 6))
plt.semilogx(x, y, 'bo-', linewidth=2) #("x,y" по чому будється 1- це по межі х 2- по у, "b" це колір лінії(blue),щоб змінити колір зміни цю букву на букву твого кольору, "o"- це маркер, якщо ти не хочеш мати точок, то забери його(або заміни на той який хочеш), "-"- це тип лінії(якщо треба лише точки, то забери мінус, якщо треба пунктир то дай --))
plt.xlabel('Частота') #текст на осі x, редагуй текст, що у лапках
plt.ylabel('Амплітуда') #текст на осі y, редагуй текст, що у лапках
plt.title('АЧХ') #головна назва таблиці, якщо треба то редагуй те, що у лапках
plt.grid(True)
plt.show()